//Написать программу на языке C#, для Windows и Mac OS, 
//[в которую пользователь вводит два целых числа] 
//[в которой записаны два целых числа] и получает сумму
int numberA = 3;
int numberВ = 5;
Console.WriteLine(numberA + numberВ );

// можно так
// int numberA = 31;
// int numberВ = 5;
// int result = numberA + numberВ;
// Console.WriteLine(result);