//Алгоритм
//Начало
//Ввести <имя пользователя>
//Вывести “Привет,
//Вывести <имя пользователя>
//Конец
Console.Write("Введите Ваше имя ");
var username = Console.ReadLine();
Console.Write("Привет, "); //вывод в одну строку
Console.Write(username); //вывод в одну строку
Console.ReadLine();